# Задача 4. Вариант 10.
# Напишите программу, которая выводит имя, под которым скрывается Уильям Сидни Портер. 
# Дополнительно необходимо вывести область интересов указанной личности, место рождения, 
# годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). 
# Для хранения всех необходимых данных требуется использовать переменные. 
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Kondrashkina
# 15.09.2016

name = "О. Генри"
print ("Уильям Сидни Портер скрывается под именем - ", name, ".")
rod = "писатель"
print ("Род деятельности: ", rod, ".")
place = "Гринсбор штат Северная Каролина"
print ("Место рождения: ", place, ".")
year = "1862 - 1910"
print ("Годы жизни: ", year, ".")
age = "48"
print ("Возраст на момент смерти: " , age, ".")

input ("\n\nНажмите Enter для выхода.")


