# Задача 1. Вариант 10.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается 
# Ричард Дженкинс. После вывода информации программа должна дожидаться пока пользователь 
# нажмет Enter для выхода.


# Kondrashkina
# 15.09.2016

print("Ричард Уолтер Дженкинс более известен, как британский актер Ричард Бёртон.")

input("\n\nНажмите Enter для выхода.")