# Задача 5. Вариант 10.
# Напишите программу, которая бы при запуске случайным образом отображала название 
# одного из шести континентов Земли.

# Kondrashkina
# 15.09.2016

b = ["Евразия", "Северная Америка", "Южная Америка", "Африка", "Австралия", "Антарктида"]
import random as random_number
print (random_number.choice(b))


input ("\n\nНажмите Enter для выхода.")


