# Задача 2. Вариант 10.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, 
# автором которого является Юстиниан. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
# Kondrashkina
# 15.09.2016

print ("Свобода есть естественная способность каждого делать то, что ему угодно, если это не запрещено силой или правом.")
print ("")
print ("			Юстиниан.")

input ("\n\nНажмите Enter для выхода.")

